Repository: Maxopenstudio/Flutter-Puzzle-game
Catalog: lib/l10n/intl_*.arb
Languages: uk

# gameShortDescLabel
source: Train Your Brain, Improve Your Math Skill
uk: Тренуйте свій мозок, покращуйте математичні навички

# mathPuzzleModeLabel
source: Math Puzzle
uk: Математична головоломка

# mathPuzzleModeShortDesc
source: Each game with simple calculation with different approach.
uk: Кожна гра з простими розрахунками з різним підходом.

# mathPuzzleCategoryCalculator
source: Calculator
uk: Калькулятор

# mathPuzzleCategoryGuessSign
source: Guess the sign?
uk: Вгадаєш знак?

# mathPuzzleCategoryCorrectAnswer
source: Correct answer
uk: Правильна відповідь

# mathPuzzleCategoryQuickCalculation
source: Quick calculation
uk: Швидке обчислення

# mathPuzzleCategoryFindMissing
source: Find Missing
uk: Знайдіть відсутнє

# mathPuzzleCategoryTrueFalse
source: True False
uk: Правда чи хиба

# mathPuzzleCategoryComplexCalculation
source: Complex Calculation
uk: Складне обчислення

# mathPuzzleCategoryDualGame
source: Dual Game
uk: Гра на двох

# mathPuzzleCategoryCalculatorInfo
source: You need to solve given equation correctly.
uk: Вам потрібно правильно вирішити задане рівняння.

# mathPuzzleCategoryGuessSignInfo
source: You need to find correct sign that finishes the given equation.
uk: Вам потрібно знайти правильний знак, який завершить задане рівняння.

# mathPuzzleCategoryFindMissingInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# mathPuzzleCategoryTrueFalseInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# mathPuzzleCategoryDualGameInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# mathPuzzleCategoryComplexCalculationInfo
source: You need to find correct sign that finishes the given equation.
uk: Вам потрібно знайти правильний знак, який завершить задане рівняння.

# mathPuzzleCategoryCorrectAnswerInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# mathPuzzleCategoryQuickCalculationInfo
source: Solve simple equation one by one. Faster you solve, more time will be given to solve next equation.
uk: Вирішуйте прості рівняння одне за одним. Чим швидше ви вирішите, тим більше часу буде дано для вирішення наступного рівняння.

# memoryPuzzleModeLabel
source: Memory Puzzle
uk: Головоломка пам'яті

# memoryPuzzleModeShortDesc
source: Memorise numbers & signs before applying calculation to them.
uk: Запам'ятовуйте числа та знаки перед їх обчисленням.

# memoryPuzzleCategoryMentalArithmetic
source: Mental arithmetic
uk: Ментальна арифметика

# memoryPuzzleCategorySquareRoot
source: Square root
uk: Квадратний корінь

# memoryPuzzleCategoryMathGrid
source: Math Grid
uk: Математична сітка

# memoryPuzzleCategoryMathematicalPairs
source: Mathematical pairs
uk: Математичні пари

# memoryPuzzleCategoryCubeRoot
source: Cube Root
uk: Кубічний корінь

# memoryPuzzleCategoryConcentration
source: Concentration
uk: Концентрація

# memoryPuzzleCategorySquareRootInfo
source: Square root the given number.
uk: Знайдіть квадратний корінь вказаного числа.

# memoryPuzzleCategoryCubeRootInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# memoryPuzzleCategoryConcentrationInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# memoryPuzzleCategoryMathematicalPairsInfo
source: Each card contains either equation or an answer. Match the equation with correct answer.
uk: Кожна картка містить або рівняння, або відповідь. Зіставте рівняння з правильною відповіддю.

# memoryPuzzleCategoryMentalArithmeticInfo
source: Number with operator will be shown one by one. You need to remember the number with operator and write final answer(No precedency).
uk: Число з оператором буде показано по одному. Вам потрібно запам'ятати число з оператором і записати кінцеву відповідь (без пріоритетів).

# memoryPuzzleCategoryMathGridInfo
source: Select number from math grid to reach answer shown above. You can select any number to reach above answer.
uk: Виберіть число з математичної сітки, щоб досягти відповіді, показаної вище. Ви можете вибрати будь-яке число, щоб досягти вищезазначеної відповіді.

# trainYourBrainModeLabel
source: Train Your Brain
uk: Тренуй свій мозок

# trainYourBrainModeShortDesc
source: Enhance logical thinking, concentration and core cognitive skills.
uk: Покращуйте логічне мислення, концентрацію та основні когнітивні навички.

# trainYourBrainMagicTriangle
source: Magic triangle
uk: Магічний трикутник

# trainYourBrainPicturePuzzle
source: Picture Puzzle
uk: Головоломка з зображенням

# trainYourBrainNumberPyramid
source: Number Pyramid
uk: Числова піраміда

# trainYourBrainNumericMemory
source: Numeric Memory
uk: Числова пам'ять

# trainYourBrainNumericMemoryInfo
source: Select the correct number to finish the equation.
uk: Виберіть правильне число, щоб завершити рівняння.

# trainYourBrainMagicTriangleInfo
source: Sum of the each side of triangle should be equal to the given number. To place any number, select triangle circle and press any given number from panel.
uk: Сума кожного боку трикутника повинна дорівнювати вказаному числу. Щоб розмістити будь-яке число, виберіть круг трикутника та натисніть будь-яке вказане число з панелі.

# trainYourBrainPicturePuzzleInfo
source: Each shape represents a number. Find the number of each shape from given equation and solve the last equation.
uk: Кожна форма представляє число. Знайдіть число кожної форми з даного рівняння та вирішіть останнє рівняння.

# trainYourBrainNumberPyramidInfo
source: Sum of consecutive cell should be placed on top cell. You need to fill all cell correctly to solve Number pyramid.
uk: Сума послідовних клітин повинна бути розміщена в верхній клітині. Вам потрібно правильно заповнити всі клітини, щоб вирішити Числову піраміду.

source: for correct answer
uk: за правильну відповідь

source: for wrong answer
uk: за неправильну відповідь

# cancelButtonLabel
source: Cancel
uk: Скасувати

# goButtonLabel
source: Go
uk: Почати

# gameOverLabel
source: Game Over!!!
uk: Гра закінчена!!!

# yourScoreLabel
source: Your Score
uk: Твій рахунок

# gameLevelLabel
source: Level
uk: Рівень

# playButtonLabel
source: Play
uk: Почати

# yourCurrentScoreLabel
source: Your current score
uk: Ваш поточний рахунок

# resumeButtonLabel
source: Resume
uk: Продовжити

# clearCalculatorButton
source: Clear
uk: Стерти

# hintHeaderLabel
source: Hint
uk: Підказка

# hintWatchVideoButtonLabel
source: Watch Video
uk: Дивитись відео

# hintByCoinButtonLabel
source: Coin
uk: Монети

# hintByCoinDescrLabel
source: Use 10 coin
uk: Використати 10 монет

# hintByCoinNoHaveCoins
source: Coin not available
uk: Не вистачає монет

# okButtonLabel
source: Ok
uk: Oк

# answerIsLabel
source: Answer is :
uk: Відповідь :

# quitLevelHeaderLabel
source: Quit!!!
uk: Вийти!!!

# quitLevelDescription
source: Are you sure you want to quit the game?
uk: Ви впевнені, що хочете покинути рівень?

# yesButtonLabel
source: Yes
uk: Так

# noButtonLabel
source: No
uk: Ні

# settingsHeaderLabel
source: Settings
uk: Налаштування

# settingsSoundLabel
source: Sound
uk: Звук

# settingsVibrationLabel
source: Vibration
uk: Вібрація

# settingsThemeLabel
source: Theme
uk: Тема

# settingsThemeDarkMode
source: Dark Mode
uk: Темний режим

# settingsShare
source: Share
uk: Поділитися

# settingsRateUs
source: Rate Us
uk: Оцінити нас

# settingsFeedback
source: Feedback
uk: Зворотній зв'язок

# settingsPrivacyPolicy
source: Privacy Policy
uk: Політика конфіденційності

# rateGiveYourOpinion
source: Give Your Opinion
uk: Висловіть свою думку

# rateGiveYourOpinionDescription
source: Make better math goal for you,and would love to know how would rate our app?
uk: Зробимо задачі краще. Ми хотіли б дізнатися, як ви оцінюєте наш додаток?

# rateCancelButton
source: Cancel
uk: Скасувати

# rateSubmitButton
source: Submit
uk: Надіслати

# feedbackHeader
source: Give Feedback
uk: Залиште відгук

# feedbackDescription
source: Give your feedback about our app
uk: Залиште свій відгук про наш додаток

# feedbackRatingQuestion
source: Are you satisfied with this app?
uk: Ви задоволені цим додатком?

# feedbackImproved
source: Tell us what can be improved!
uk: Скажіть нам, що можна покращити!

# feedbackWrite
source: Write your feedback...
uk: Напишіть свій відгук...

# feedbackSubmitButton
source: Submit Feedback
uk: Надіслати відгук

# difficultyHeaderLabel
source: Select Difficulty
uk: Виберіть рівень складності

# difficultyEasy
source: Easy
uk: Легкий

# difficultyMedium
source: Medium
uk: Середній

# difficultyHard
source: Hard
uk: Складний

# restartButton
source: Restart
uk: Рестарт

# dualQuiz
source: Quiz
uk: Питання

# playerOne
source: Player 1
uk: Гравець 1

# playerTwo
source: Player 2
uk: Гравець 2
